Hzghero/motorcycle-led-remote-driver-v2/reference STM32c011f6p6-xl2400t/Core/Src/main.c
#if APP_ROLE_TX_ONLY
  /* TX 角色：三键输入（上升沿中断 + 下拉） */
  GPIO_InitStruct.Pin = L_KEY_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
  GPIO_InitStruct.Pull = GPIO_PULLDOWN;
  HAL_GPIO_Init(L_KEY_GPIO_Port, &GPIO_InitStruct);

  GPIO_InitStruct.Pin = M_KEY_Pin|R_KEY_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
  GPIO_InitStruct.Pull = GPIO_PULLDOWN;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
#else
  /* RX 角色：复用三键IO作为车辆输入（ACC/远光/喇叭），采用普通输入轮询 */
  GPIO_InitStruct.Pin = L_KEY_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_PULLDOWN;
  HAL_GPIO_Init(L_KEY_GPIO_Port, &GPIO_InitStruct);

  GPIO_InitStruct.Pin = M_KEY_Pin|R_KEY_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_PULLDOWN;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
#endif

  /*Configure GPIO pins : MOS_L_HI_Pin MOS_L_LO_Pin MOS_R_HI_Pin MOS_R_LO_Pin */
  GPIO_InitStruct.Pin = MOS_L_HI_Pin|MOS_L_LO_Pin|MOS_R_HI_Pin|MOS_R_LO_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_MEDIUM;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pins : RF_CSN_Pin RF_SCK_Pin RF_DATA_Pin */
  GPIO_InitStruct.Pin = RF_CSN_Pin|RF_SCK_Pin|RF_DATA_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pin : LED_Pin */
  GPIO_InitStruct.Pin = LED_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(LED_GPIO_Port, &GPIO_InitStruct);

  /* USER CODE BEGIN MX_GPIO_Init_2 */
  HAL_NVIC_SetPriority(EXTI0_1_IRQn, 1, 0);
  HAL_NVIC_EnableIRQ(EXTI0_1_IRQn);
  HAL_NVIC_SetPriority(EXTI4_15_IRQn, 1, 0);
  HAL_NVIC_EnableIRQ(EXTI4_15_IRQn);

  /* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */
/* ===== 双路 PWM 灯效输出（RX-only）===== */

static uint16_t Pwm_GetArrPlus1(void)
{
  uint32_t arr = __HAL_TIM_GET_AUTORELOAD(&htim1);
  if (arr > 0xFFFFU) arr = 0xFFFFU;
  return (uint16_t)(arr + 1U);
}

static uint16_t Bright_ToPulse(uint8_t bright)
{
  uint16_t arrp1 = Pwm_GetArrPlus1();
  uint32_t pct = 30U;
  if (bright == TLIGHT_BRIGHT_70) pct = 70U;
  else if (bright == TLIGHT_BRIGHT_100) pct = 100U;
  return (uint16_t)((arrp1 * pct) / 100U);
}

/* 四路灯通道位图定义（仅用于 MOS 导通选择） */
#define CH_L_HI_MASK  (1U << 0)
#define CH_L_LO_MASK  (1U << 1)
#define CH_R_HI_MASK  (1U << 2)
#define CH_R_LO_MASK  (1U << 3)

/* 设置全局亮度 PWM（PA2/TIM1_CH3）：
 * - 正常模式：按 pulse 输出占空比
 * - 调试模式：可强制 0% 或 100% 验证 MOS 通道逻辑 */
static void PwmGlobal_Set(uint16_t pulse)
{
  uint16_t arrp1 = Pwm_GetArrPlus1();
  if (pulse > arrp1) pulse = arrp1;

#if (PWM_GLOBAL_FORCE_LEVEL == 1U)
  __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_3, 0U);
#elif (PWM_GLOBAL_FORCE_LEVEL == 2U)
  __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_3, arrp1);
#else
  __HAL_TIM_SET_COMPARE(&htim1, TIM_CHANNEL_3, pulse);
#endif
}

/* 应用四路 MOS 通道掩码：
 * - 1 表示导通该通道
 * - 0 表示关断该通道
 * 说明：MOS 仅用于通道选择，不做亮度调制。 */
static void Channel_ApplyMask(uint8_t mask)
{
  HAL_GPIO_WritePin(MOS_L_HI_GPIO_Port, MOS_L_HI_Pin, (mask & CH_L_HI_MASK) ? GPIO_PIN_SET : GPIO_PIN_RESET);
  HAL_GPIO_WritePin(MOS_L_LO_GPIO_Port, MOS_L_LO_Pin, (mask & CH_L_LO_MASK) ? GPIO_PIN_SET : GPIO_PIN_RESET);
  HAL_GPIO_WritePin(MOS_R_HI_GPIO_Port, MOS_R_HI_Pin, (mask & CH_R_HI_MASK) ? GPIO_PIN_SET : GPIO_PIN_RESET);
  HAL_GPIO_WritePin(MOS_R_LO_GPIO_Port, MOS_R_LO_Pin, (mask & CH_R_LO_MASK) ? GPIO_PIN_SET : GPIO_PIN_RESET);
}

static void PairingLed_Update(uint32_t now)
{
  /* 对码反馈优先级最高，且必须非阻塞，避免影响按键扫描 */
  if (g_pair_fb_state == PAIR_FB_SUCCESS) {
    g_led_state = 0;
    if ((now - g_pair_fb_tick) >= 120U) {
      g_pair_fb_tick = now;
      HAL_GPIO_TogglePin(LED_GPIO_Port, LED_Pin);
      g_pair_fb_step++;
      if (g_pair_fb_step >= 6U) {
        HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_RESET);
        g_pair_fb_state = PAIR_FB_NONE;
        g_pair_fb_step = 0U;
      }
    }
    return;
  }

  if (g_pair_fb_state == PAIR_FB_FAIL) {
    g_led_state = 0;
    HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_SET);
    if ((now - g_pair_fb_tick) >= 1000U) {
      HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_RESET);
      g_pair_fb_state = PAIR_FB_NONE;
    }
    return;
  }

  if (g_pairing_mode == 0U) {
    return;
  }

  /* 对码窗口期间：LED 由对码逻辑独占，普通短亮提示不允许抢占 */
  g_led_state = 0;

  if ((now - g_pair_led_tick) >= 200U) {
    g_pair_led_tick = now;
    HAL_GPIO_TogglePin(LED_GPIO_Port, LED_Pin);
  }
}

static void PairingLed_Feedback(uint8_t success)
{
  /* 反馈期间关闭普通短亮状态，防止抢占 */
  g_led_state = 0;
  g_pair_fb_tick = HAL_GetTick();
  g_pair_fb_step = 0U;

  if (success != 0U) {
    g_pair_fb_state = PAIR_FB_SUCCESS;
    HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_SET);
  } else {
    g_pair_fb_state = PAIR_FB_FAIL;
    HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_SET);
  }
}

/* RX 三线输入处理（冲突优先级状态表）
 * P0: ACC=0 -> 强制OFF（最高优先级）
 * P1: ACC=1 且 HORN=1 -> 强制爆闪（模式4）
 * P2: HORN 下降沿释放 -> 回到黄线状态（HI=1远光/HI=0近光）
 * P3: HORN=0 时，黄线边沿控制近/远光（上升=远光，下降=近光）
 * P4: 遥控命令仅在未触发 P0/P1 强制态时生效（已落地）。 */
static void RxWireInput_Poll(uint32_t now)
{
#if APP_ROLE_RX_ONLY
  uint8_t acc  = (HAL_GPIO_ReadPin(RX_ACC_IN_PORT, RX_ACC_IN_PIN) == RX_IN_ACTIVE_LEVEL) ? 1U : 0U;
  uint8_t hi   = (HAL_GPIO_ReadPin(RX_CAR_HI_IN_PORT, RX_CAR_HI_IN_PIN) == RX_IN_ACTIVE_LEVEL) ? 1U : 0U;
  uint8_t horn = (HAL_GPIO_ReadPin(RX_HORN_IN_PORT, RX_HORN_IN_PIN) == RX_IN_ACTIVE_LEVEL) ? 1U : 0U;

  (void)now;

  if (acc == 0U) {
    g_rx_horn_active = 0U;
    g_light_mode = TLIGHT_MODE_OFF;
    g_rx_acc_last = acc;
    g_rx_hi_last = hi;
    g_rx_horn_last = horn;
    return;
  }

  if ((horn != 0U) && (g_rx_horn_last == 0U)) {
    /* 喇叭上升沿：先快照当前状态，再进入爆闪覆盖态 */
    g_rx_pre_horn_mode = g_light_mode;
    g_rx_pre_horn_bright = g_light_bright;
    g_rx_remote_pending_valid = 0U;

    g_rx_horn_active = 1U;
    g_light_mode = 4U; /* 映射到模式4 */
    g_light_bright = TLIGHT_BRIGHT_100;
  }
  if ((horn == 0U) && (g_rx_horn_last != 0U)) {
    g_rx_horn_active = 0U;

    /* 喇叭释放优先级：
     * 1) HORN期间若有遥控pending，优先应用pending
     * 2) 否则恢复到HORN触发前快照状态 */
    if (g_rx_remote_pending_valid != 0U) {
      g_light_mode = g_rx_remote_pending_mode;
      g_light_bright = g_rx_remote_pending_bright;
      g_rx_remote_pending_valid = 0U;
    } else {
      g_light_mode = g_rx_pre_horn_mode;
      g_light_bright = g_rx_pre_horn_bright;
    }
  }

